app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1
---
  def index
    @users = User.find(:all, :order => :name)

SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1
---
  def show
    @user = User.find(params[:id])

INSERT INTO `users` (`name`, `salt`, `created_at`, `updated_at`, `hashed_password`, `role`) VALUES('test', '-6126612780.423740859108675', '2009-02-01 18:43:48', '2009-02-01 18:43:48', '3a9326240f810d445a548ab987190f3036cb5483', 'test')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 2)
UPDATE `users` SET `updated_at` = '2009-02-01 18:55:01', `salt` = '-6118673180.849926230239099', `hashed_password` = 'ff86a1210933c21f16231ed5a9dce8bd5f89b079' WHERE `id` = 2
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])